kodilla-soap-library/sample/library-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:kodilla="http://kodilla.com/library/soap">
    <soapenv:Header/>
    <soapenv:Body>
        <kodilla:getBookRequest>
            <kodilla:signature>123abc</kodilla:signature>
        </kodilla:getBookRequest>
    </soapenv:Body>
</soapenv:Envelope>